Repository: ermitz/pyRenamer
Catalog: po/*.po
Languages: de

source: Original file name
de: Ursprünglicher Dateiname

source: Renamed file name
de: Umbenannter Dateiname

source: Could not rename file %s to %s %s
de: Konnte Datei »%s« nicht nach »%s« umbenennen %s

source: Select file
de: Wähle Datei

source: Reading contents of dir %s
de: Lese Inhalt des Ordners »%s«

source: Directory: %s - Files: %s
de: Ordner: »%s« - Dateien: %s

source: Adding file %s
de: Füge Datei »%s« hinzu

source: Ignore errors
de: Ignorieren Fehler

source: translator-credits
de: Vinzenz Vietzke <vinz@v1nz.org> Christian Kirbach <Christian.Kirbach@googlemail.com>

source: Error while renaming %s to %s! -> %s already exists!
de: Fehler beim Umbenennen von »%s« nach »%s«! -> »%s« existiert bereits!

source: Error while renaming %s to %s!
de: Fehler beim Umbenennen von »%s« nach »%s«!

source: Mass file renamer for GNOME
de: Massen-Dateien-Umbenenner für GNOME

source: Patterns editor
de: Muster bearbeiten

source: Image patterns editor
de: Muster für Bilder bearbeiten

source: Music patterns editor
de: Muster für Musik bearbeiten

source: Video patterns editor
de: Muster für Video bearbeiten

source: Select root directory
de: Wählen Sie den Ursprungs-Ordner

source: Select active directory
de: Wählen Sie den aktiven Ordner

source: The root directory is not valid! Please select another directory.
de: Der Ursprungs-Ordner ist ungültig! Bitte wählen Sie einen anderen Ordner.

source: The active directory is not valid! Please select another directory.
de: Der aktive Ordner ist ungültig! Bitte wählen Sie einen anderen Ordner.

source: Please set both directories!
de: Bitte legen Sie beide Ordner fest!

source: <b>Original: </b> %s <b>Renamed: </b> %s
de: <b>Original: </b> »%s« <b>Umbenannt: </b> »%s«

source: Show hidden files
de: Versteckte Dateien anzeigen

source: Add pattern
de: Muster hinzufügen

source: Pattern:
de: Muster:

source: _File
de: _Datei

source: _Preview
de: _Vorschau

source: _Rename
de: _Umbenennen

source: _Load names from file...
de: Namen aus Datei _laden...

source: C_lear Preview
de: Vorschau _leeren

source: _Edit
de: B_earbeiten

source: Select _all
de: _Alles wählen

source: Select _nothing
de: _Nichts wählen

source: _View
de: _Anzeigen

source: Patterns
de: Muster

source: Substitutions
de: Ersetzungen

source: Insert / Delete
de: Einfügen / Löschen

source: Manual rename
de: Manuelles Umbenennen

source: Images
de: Bilder

source: Music
de: Musik

source: Show options
de: Optionen zeigen

source: _Help
de: _Hilfe

source: <b>Options</b>
de: <b>Optionen</b>

source: Files Directories Files and directories
de: Dateien Ordner Dateien und Ordner

source: Selection pattern
de: Auswahlmuster

source: * Select every visible file *.jpg Select just files that end with the "jpg" extension Select every file (including hidden ones) .* Select files starting by "."
de: * Jede sichtbare Datei wählen *.jpg Nur Dateien mit "jpg"-Erweiterung wählen Alle Dateien wählen (inklusive der Versteckten) .* Dateien wählen, die mit "." beginnen

source: Add files recursively
de: Dateien rekursiv hinzufügen

source: Keep extensions
de: Erweiterungen behalten

source: Preview automatically
de: Vorschau automatisch zeigen

source: Use {1} for first catched item. {2} for second, etc... Use {num} for adding 1, 2, 3... to file names Use {num2} for 01, 02, 03..... Use {num3} for 001, 002, 003... Use {num+10} for 10, 11, 12... Use {num2+10} for 010, 011, 012... Use {dir} for getting current dir Some today date replacements: {date} 22feb1980 {year} 1980 {month} 02 {monthname} february {monthsimp} feb {day} 22 {dayname} friday {daysimp} fri Random number replacements: {rand} is random number between 0 and 100. {rand,3} is random number between 0 and 100 of 3 digits (012) {rand500} is random number between 0 and 500 {rand10-20} is random number between 10 and 20 {rand20,5} is random number between 0 and 20 of 5 digits (00012)
de: Verwende {1} für das erste gefundene Objekt. {2} für das Zweite, etc... Verwende {num} um 1, 2, 3... an die Dateinamen anzuhängen Verwende {num2} für 01, 02, 03..... Verwende {num3} für 001, 002, 003... Verwende {num+10} für 10, 11, 12... Verwende {num2+10} für 010, 011, 012... Verwende {dir} um den aktuellen Ordner zu bekommen Einige Ersetzungen für das aktuelle Datum: {date} 22feb1980 {year} 1980 {month} 02 {monthname} februar {monthsimp} feb {day} 22 {dayname} freitag {daysimp} fri Ersetzungen mit Zufallszahlen: {rand} ist eine Zufallszahl zwischen 0 und 100. {rand,3} ist eine Zufallszahl zwischen 0 und 100 von 3 Ziffern (012) {rand500} ist eine Zufallszahl zwischen 0 und 500 {rand10-20} ist eine Zufallszahl zwischen 10 und 20 {rand20,5} ist eine Zufallszahl zwischen 0 und 20 von 5 Ziffern (00012)

source: {#} Numbers {L} Letters {C} Characters (numbers and letters, not spaces) {X} Numbers, letters, and spaces {@} Trash
de: {#} Zahlen {L} Buchstaben {C} Zeichen (Zahlen und Buchstaben, keine Leerzeichen) {X} Zahlen, Buchstaben, und Leerzeichen {@} Müll

source: <i>Put the mouse over the text fields to get help on which patterns you can use</i>
de: <i>Bewegen Sie den Mauszeiger über die Textfelder, um Hilfe bezüglich der nutzbaren Muster zu bekommen</i>

source: <b>Rename files using patterns</b>
de: <b>Dateien anhand von Mustern umbenennen</b>

source: Renamed file name pattern
de: Muster für den umbenannten Dateinamen

source: Original file name pattern
de: Muster für den ursprünglichen Dateinamen

source: Spaces to Underscores Underscores to Spaces Spaces to Dots Dots to Spaces Spaces to Dashes Dashes to Spaces
de: Leerzeichen in Unterstriche Unterstriche in Leerzeichen Leerzeichen in Punkte Punkte in Leerzeichen Leerzeichen in Bindestriche Bindestriche in Leerzeichen

source: with
de: durch

source: Remove accents
de: Akzente entfernen

source: All uppercase All downcase First letter uppercase First letter uppercase of each word
de: Alle in Großbuchstaben Alle in Kleinbuchstaben Erster Buchstabe groß Erster Buchstabe jedes Wortes groß

source: Capitalization
de: Großschreibung

source: Replace
de: Ersetzen

source: Spaces
de: Leerzeichen

source: <b>Common substitutions</b>
de: <b>Gewöhnliche Ersetzungen</b>

source: Fix duplicated symbols
de: Doppelte Symbole reparieren

source: Changes: ..... to . ---- to - ____ to _ ' ' to ' '
de: Änderungen: ..... nach . ---- nach - ____ nach _ ' ' nach ' '

source: Delete from
de: Löschen von

source: to
de: bis

source: <b>Insert or delete characters from filenames</b>
de: <b>Zeichen in Dateinamen einfügen oder löschen</b>

source: Insert
de: Einfügen

source: at
de: bei

source: or at the end
de: oder am Ende

source: <b>Rename files manually</b>
de: <b>Dateien manuell umbenennen</b>

source: New file name
de: Neuer Dateiname

source: <i>Select the file to rename, change its name and click Preview</i>
de: <i>Wählen Sie die umzubenennende Datei, ändern Sie den Namen und klicken Sie auf Vorschau</i>

source: Image metadata replacements: {imagewidth} 640 {imageheight} 480 {cameramaker} Nikon {cameramodel} D-50 {imagedate} 22feb1980 {imageyear} 1980 {imagemonth} 02 {imagemonthname} february {imagemonthsimp} feb {imageday} 22 {imagedayname} friday {imagedaysimp} fri {imagetime} 13_56_02 {imagehour} 13 {imageminute} 56 {imagesecond} 02 Common replacements: Use {1} for first catched item. {2} for second, etc... Use {num} for adding 1, 2, 3... to file names Use {num2} for 01, 02, 03..... Use {num3} for 001, 002, 003... Use {num+10} for 10, 11, 12... Use {num2+10} for 010, 011, 012... Use {dir} for getting current dir Some today date replacements: {date} 22feb1980 {year} 1980 {month} 02 {monthname} february {monthsimp} feb {day} 22 {dayname} friday {daysimp} fri Random number replacements: {rand} is random number between 0 and 100. {rand,3} is random number between 0 and 100 of 3 digits (012) {rand500} is random number between 0 and 500 {rand10-20} is random number between 10 and 20 {rand20,5} is random number between 0 and 20 of 5 digits (00012)
de: Ersetzung von EXIF-Bilddaten: {imagewidth} 640 {imageheight} 480 {cameramaker} Nikon {cameramodel} D-50 {imagedate} 22feb1980 {imageyear} 1980 {imagemonth} 02 {imagemonthname} februar {imagemonthsimp} feb {imageday} 22 {imagedayname} freitag {imagedaysimp} fri {imagetime} 13_56_02 {imagehour} 13 {imageminute} 56 {imagesecond} 02 Allgemeine Ersetzungen: Verwende {1} für das erste gefundene Objekt. {2} für das Zweite, etc... Verwende {num} um 1, 2, 3... an die Dateinamen anzuhängen Verwende {num2} für 01, 02, 03..... Verwende {num3} für 001, 002, 003... Verwende {num+10} für 10, 11, 12... Verwende {num2+10} für 010, 011, 012... Verwende {dir} um den aktuellen Ordner zu bekommen Einige Ersetzungen für das aktuelle Datum: {date} 22feb1980 {year} 1980 {month} 02 {monthname} februar {monthsimp} feb {day} 22 {dayname} freitag {daysimp} fri Ersetzungen mit Zufallszahlen: {rand} ist eine Zufallszahl zwischen 0 und 100. {rand,3} ist eine Zufallszahl zwischen 0 und 100 von 3 Ziffern (012) {rand500} ist eine Zufallszahl zwischen 0 und 500 {rand10-20} ist eine Zufallszahl zwischen 10 und 20 {rand20,5} ist eine Zufallszahl zwischen 0 und 20 von 5 Ziffern (00012)

source: {#} Numbers {L} Letters {C} Characters (numbers and letters, not spaces) {X} Numbers, letters, and spaces {@} Trash
de: {#} Zahlen {L} Buchstaben {C} Zeichen (Zahlen und Buchstaben, keine Leerzeichen) {X} Zahlen, Buchstaben, und Leerzeichen {@} Müll

source: <b>Rename images using their metadata</b>
de: <b>Bilder anhand ihrer Meta-Daten umbennen</b>

source: <b>Rename videos using their metadata</b>
de: <b>Video anhand ihrer Meta-Daten umbennen</b>

source: Music metadata replacements: {artist} AnxiA {title} El mundo no es una mercancÃ­a {album} JÃ³ven pÃ¡jaro negro muerto {track} 02 {tracktotal} 10 {myear} 2006 {genre} Hardcore Common replacements: Use {1} for first catched item. {2} for second, etc... Use {num} for adding 1, 2, 3... to file names Use {num2} for 01, 02, 03..... Use {num3} for 001, 002, 003... Use {num+10} for 10, 11, 12... Use {num2+10} for 010, 011, 012... Use {dir} for getting current dir Some today date replacements: {date} 22feb1980 {year} 1980 {month} 02 {monthname} february {monthsimp} feb {day} 22 {dayname} friday {daysimp} fri Random number replacements: {rand} is random number between 0 and 100. {rand,3} is random number between 0 and 100 of 3 digits (012) {rand500} is random number between 0 and 500 {rand10-20} is random number between 10 and 20 {rand20,5} is random number between 0 and 20 of 5 digits (00012)
de: MP3 Musik ID3-Ersetzungen: {artist} AnxiA {title} El mundo no es una mercancía {album} Jóven pájaro negro muerto {track} 02 {tracktotal} 10 {year} 2006 {genre} Hardcore Allgemeine Ersetzungen: Verwende {1} für das erste gefundene Objekt. {2} für das Zweite, etc... Verwende {num} um 1, 2, 3... an die Dateinamen anzuhängen Verwende {num2} für 01, 02, 03..... Verwende {num3} für 001, 002, 003... Verwende {num+10} für 10, 11, 12... Verwende {num2+10} für 010, 011, 012... Verwende {dir} um den aktuellen Ordner zu bekommen Einige Ersetzungen für das aktuelle Datum: {date} 22feb1980 {year} 1980 {month} 02 {monthname} februar {monthsimp} feb {day} 22 {dayname} freitag {daysimp} fri Ersetzungen mit Zufallszahlen: {rand} ist eine Zufallszahl zwischen 0 und 100. {rand,3} ist eine Zufallszahl zwischen 0 und 100 von 3 Ziffern (012) {rand500} ist eine Zufallszahl zwischen 0 und 500 {rand10-20} ist eine Zufallszahl zwischen 10 und 20 {rand20,5} ist eine Zufallszahl zwischen 0 und 20 von 5 Ziffern (00012)

source: <b>Rename music using its metadata</b>
de: <b>Musik anhand ihrer Meta-Daten umbennen</b>

source: C_lear
de: _Leeren

source: Pattern editor
de: Muster bearbeiten

source: pyRenamer preferences
de: pyRenamer Voreinstellungen

source: <b>Default directories</b>
de: <b>Standardordner</b>

source: <i>The parent of the directories tree</i>
de: <i>Der Elternordner des Ordnerbaums</i>

source: <i>The default selected directory</i>
de: <i>Der Vorgabeordner</i>

source: Active
de: Aktiv

source: Root
de: Ursprung

source: Browse...
de: Durchsuchen...
